def filter_by_currency():
    """
    Функция, которая принимает на вход список словарей.
    Функция должна возвращать итератор, который поочередно выдает транзакции,
    где валюта операции соответствует заданной (например, USD)
    """
    pass


def transaction_descriptions():
    """
    Функция принимает список словарей с транзакциями и возвращает описание каждой операции по очереди.
    """
    pass


def card_number_generator():
    """
    Функция для генерирования номера карта в диапазоне
    от 0000 0000 0000 0001
    до 9999 9999 9999 9999
    """
    pass
